performance test pratice/post.yml
config:
  target: "http://httpbin.org/"
  phases:
    - duration: 1
      arrivalRate: 1
      name: Goit Performance Test

  plugins:
    ensure:  
      thresholds:                         
        - http.response_time.max: 1500      
        - http.response_time.2xx.p99: 600            
    conditions:
        - expression: http.responses == 2
        - expression: vusers.failed == 0      
        - expression: http.responses_time.max <1000 and http.responses_time.2xx.p95 <500        

scenarios:
  - name: Create Account
    flow:
      - post:
          url: "{{ target }}post"        
          json:                    
            username: "Goit"      
            password: "12345"
          headers:
            Content-Type: "application/json"
          capture:               
            - json: "$.json"     
              as: "response_body"   
            - json: "$.headers.Host"    
              as: "host"                
      - log: "Response Body : {{response_body}}"  
      - log: "Host : {{host}}"