performance test pratice/post2.yml
config:
  target: "http://httpbin.org/"
  phases:
    - duration: 1
      arrivalRate: 1
      name: Goit Performance Test

  payload:
    -
      path: "abc.csv"        
      fields:
        - "keyword1"
        - "keyword2"          
      order: sequence    

scenarios:
  - name: Create Account
    flow:
      - get:
          url: "{{target}}get?param1={{ keyword1 }}"       
      - post:
          url: "{{target}}post?param2={{ keyword2 }}" 
          json:                    
            username: "Goit"      
            password: "12345"
          headers:
            Content-Type: "application/json"  
          capture:               
            - json: "$.json"     
              as: "response_body"       
            - json: "$.headers.Host" 
              as: "host"                
      - log: "Response Body : {{response_body}}"  
      - log: "Host : {{host}}"   
      - log: "ilk deger: {{ keyword1 }}"
      - log: "ikinci deger: {{ keyword2 }}"